name = input("Введите свое имя: ")
age = input("Введите сколько вам лет: ")
city = input("Введите название населенного пункта, где вы проживаете: ")
profession = input("введите свою профессию: ")
weapons = input("Введите свое любимое оружие: ")
enemy =input("Введите имя своего врага: ")
a_dream = input("Введите свою мечту: ")
a_fruit = input("введите имя любимого фрукта: ")
swear_word = input("Введите ваше любимое ругательство (можно матом, вас не забанят): ")
a_build = input("Введите название своего любимого ресторана или кафе: ")
a_location = input("Введите место где вы любите отдыхать: ")
z1 = (f"Меня зовут {name}.\n Мне {age} лет, и я родом из {city}.\n"
      f"Я - {profession}, давно забытая легендами, но все еще опасна после третьей рюмки водки.\n"
      f"Мое верное оружие - {weapons}, всегда при мне. \n Мы многое пережили вместе, в том числе и развод и налоговую проверку.\n"
      f"Мой заклятый враг {enemy}, с которым я свела свои счеты еще в 2012 году. \n Но сведение счетов с ним меня морально не отпустило\n"
      f"\n"
      f"Все, чего я хотела в этой жизни, - это {a_dream}.\n"
      f"Я шла к ней сквозь пески времени, бури отчаяния и маршрутки с пересадкой.\n"
      f"Но судьба, как обычно, поставило всех раком.\n"
      f"Сегодня утром, подскользнувшись на корке {a_fruit}, я с криком {swear_word}!\n"
      f"врезалась в {a_build}, прямо посреди {a_location}.\n"
      f"\n"
      f"И что бы вы думали?\n"
      f"Прямо передо мной, в кастрюле с подгоревшей кашей и ценником \"2.99\", лежала она - моя мечта - {a_dream}.\n"
      f"Теперь я не ищу {a_dream}.\n"
      f"А еще запахло гарью. Но это уже другая история.\n")
print(z1)
