# Напишите функцию, которая принимает на вход строку и возвращает ее длину.
# Пример:
# Ввод: "Hail Hitler"
# Вывод: 1488
print("Hail Hitler")