# Дополнительная практика


# 1. Создайте декоратор requires_auth, который проверяет наличие определенного флага authenticated и выполняет
# функцию только если этот флаг установлен в True.
#
authenticated = False

# Вывод: Доступ запрещен: пользователь не аутентифицирован

# Вывод: Секретная информация


# 2. Создайте декоратор call_counter, который отслеживает количество вызовов декорируемой функции и
# выводит это количество при каждом вызове.
#
#
# # Вывод:
# # Функция greet вызвана 1 раз(а)
# # Привет, Алиса!
#
# # Вывод:
# # Функция greet вызвана 2 раз(а)
# # Привет, Боб!


