#     - [х] в выбранных вариантах проставьте х или пропишите решение, если вариантов ответа не предусмотрено
#
# Задание 1. Что представляет собой переменная в Python?
#     - [X] хранилище данных
#     - [ ] ничего из перечисленного
#     - [ ] и ссылка, и хранилище данных
#     - [ ] ссылка на объект в памяти
#
# Задание 2. Что делает оператор присваивания (=)?
#     - [ ] создает переменную, если ее ранее не было
#     - [X] связывает переменную с данными
#     - [ ] обнуляет значение переменной
#     - [ ] заносит данные в переменную
#     - [ ] удаляет переменную с указанным именем
#
# Задание 3. Какая типизация реализована в Python? Отметьте все верные варианты.
#     - [ ] строгая типизация
#     - [X] динамическая типизация
#     - [ ] нестрогая типизация
#     - [ ] статическая типизация
#
# Задание 4. Что происходит при присваивании одной переменной другой (a = b)?
#     - [ ] создаются две переменные, если они до этого не существовали, с нулевыми значениями
#     - [ ] такая операция недопустима: можно присваивать только объекты, а не переменные
#     - [X] копирование данных и переменная a будет содержать копию информации из переменной b
#     - [ ] копирование ссылки и обе переменные ссылаются на один и тот же объект
#
# Задание 5. Как называется присваивание вида a = b = c = 0?
#     - [ ] цепным присваиванием
#     - [X] каскадным присваиванием
#     - [ ] такая операция недопустима
#     - [ ] множественным присваиванием
#     - [ ] унитарным присваиванием
#
# Задание 6. Как называется присваивание вида a, b = 1, 2?
#     - [ ] каскадным присваиванием
#     - [ ] унитарным присваиванием
#     - [ ] цепным присваиванием
#     - [ ] такая операция недопустима
#     - [X] множественным присваиванием
#
# Задание 7. Для чего используется функция type?
#     - [ ] для определения типа объекта, но не переменной
#     - [X] для определения типа переменной, но не объекта
#     - [ ] для определения типа переменной или объекта
#     - [ ] такой функции в языке Python нет
#
# Задание 8. Выберите только правильные имена переменных.
#     - [ ] \n
#     - [ ] 7_b
#     - [X] var_a
#     - [X] S
#     - [X] _b
#     - [X] __arg_c__
#     - [X] d25
#     - [ ] don't
#     - [ ] 25d
#     - [X] TT1
#
# Задание 9. Различаются ли имена переменных arg, Arg, ARG?
#     - [X] да
#     - [ ] нет
#     - [ ] такие имена недопустимы
#     - [ ] иногда
#
# Задание 10. Выберите верные варианты присвоения данных переменной b (считается, что других переменных в программе нет).
#     - [X] b = "hello"
#     - [X] b = "True"
#     - [ ] "abc" = b
#     - [ ] 5 = b
#     - [X] False = b
#     - [X] b = 5.8
#     - [ ] b = hello
#
# Задание 11. Что произойдет, если функции type присвоить число 7 (type = 7)?
#     - [ ] операция будет просто проигнорирована и программа продолжит выполняться дальше
#     - [ ] функция type возвратит тип числа 7
#     - [ ] число 7 станет синонимом функции type
#     - [X] произойдет ошибка, так как type - это встроенная функция языка Python
#     - [ ] переменная type будет ссылаться на число 7

# Задание 12. Придумайте и запишите напротив названия переменным, в которых будут храниться:
#    height - высота
#    width - ширина
#    cost - стоимость товара
#    age - возраст
#    error - сообщение об ошибке
#    success - сообщение об успехе
#    count_student - количество студентов
#    user_name - имя пользователя
#    average_t_of_day - Средняя температура за день
#    summary_sells_month - Общий объем продаж за месяц
#    sum_watch_video - Количество просмотров видео
#    email - Электронный адрес пользователя
#    free_places - Количество доступных мест в аудитории
#    MAXIMAL_LIFT_WEIGHT_BEFORE_ERRORS_OF_WORKING_AGREGATE - Максимальная грузоподъемность лифта
#    percent_progress - Процент выполнения задачи
#    rating_user_service - Оценка пользователя после обслуживания
#    summary_time_in_queue - Суммарное время ожидания в очереди
#    total_pages_in_document - Число страниц в документе

