#     - [х] в выбранных вариантах проставьте х или пропишите решение, если вариантов ответа не предусмотрено
#
# Задание 1. Что представляет собой переменная в Python?
#     - [ ] хранилище данных
#     - [ ] ничего из перечисленного
#     - [ ] и ссылка, и хранилище данных
#     - [+] ссылка на объект в памяти
#
# Задание 2. Что делает оператор присваивания (=)?
#     - [ ] создает переменную, если ее ранее не было
#     - [ ] связывает переменную с данными
#     - [ ] обнуляет значение переменной
#     - [+] заносит данные в переменную
#     - [ ] удаляет переменную с указанным именем
#
# Задание 3. Какая типизация реализована в Python? Отметьте все верные варианты.
#     - [ ] строгая типизация
#     - [+] динамическая типизация
#     - [ ] нестрогая типизация
#     - [ ] статическая типизация
#
# Задание 4. Что происходит при присваивании одной переменной другой (a = b)?
#     - [ ] создаются две переменные, если они до этого не существовали, с нулевыми значениями
#     - [ ] такая операция недопустима: можно присваивать только объекты, а не переменные
#     - [ ] копирование данных и переменная a будет содержать копию информации из переменной b
#     - [+] копирование ссылки и обе переменные ссылаются на один и тот же объект
#
# Задание 5. Как называется присваивание вида a = b = c = 0?
#     - [+] цепным присваиванием
#     - [ ] каскадным присваиванием
#     - [ ] такая операция недопустима
#     - [ ] множественным присваиванием
#     - [ ] унитарным присваиванием
#
# Задание 6. Как называется присваивание вида a, b = 1, 2?
#     - [ ] каскадным присваиванием
#     - [ ] унитарным присваиванием
#     - [ ] цепным присваиванием
#     - [ ] такая операция недопустима
#     - [+] множественным присваиванием
#
# Задание 7. Для чего используется функция type?
#     - [ ] для определения типа объекта, но не переменной
#     - [+] для определения типа переменной, но не объекта
#     - [ ] для определения типа переменной или объекта
#     - [ ] такой функции в языке Python нет
#
# Задание 8. Выберите только правильные имена переменных.
#     - [ ] \n
#     - [ ] 7_b
#     - [+] var_a
#     - [+] S
#     - [ ] _b
#     - [ ] __arg_c__
#     - [+] d25
#     - [ ] don't
#     - [ ] 25d
#     - [+] TT1
#
# Задание 9. Различаются ли имена переменных arg, Arg, ARG?
#     - [+] да
#     - [ ] нет
#     - [ ] такие имена недопустимы
#     - [ ] иногда
#
# Задание 10. Выберите верные варианты присвоения данных переменной b (считается, что других переменных в программе нет).
#     - [+] b = "hello"
#     - [+] b = "True"
#     - [ ] "abc" = b
#     - [ ] 5 = b
#     - [ ] False = b
#     - [+] b = 5.8
#     - [ ] b = hello
#
# Задание 11. Что произойдет, если функции type присвоить число 7 (type = 7)?
#     - [ ] операция будет просто проигнорирована и программа продолжит выполняться дальше
#     - [ ] функция type возвратит тип числа 7
#     - [ ] число 7 станет синонимом функции type
#     - [+] произойдет ошибка, так как type - это встроенная функция языка Python
#     - [ ] переменная type будет ссылаться на число 7

# Задание 12. Придумайте и запишите напротив названия переменным, в которых будут храниться:
#     height - высота
#     width - ширина
#     price - стоимость товара
#     Age - возраст
#     Error - сообщение об ошибке
#     Success - сообщение об успехе
#     number_student - количество студентов
#     name_user- имя пользователя
#     average_temperature- Средняя температура за день
#     total_sales - Общий объем продаж за месяц
#    number_of_video_views - Количество просмотров видео
#    email - Электронный адрес пользователя
#    number_of_seats_in_the_auditorium - Количество доступных мест в аудитории
#    Maximum_lift_capacity- Максимальная грузоподъемность лифта
#    Task_completion_percentage - Процент выполнения задачи
#    User_rating_after_service - Оценка пользователя после обслуживания
#    Total_waiting_time_in_queue- Суммарное время ожидания в очереди
#    Number_of_pages_in_document- Число страниц в документе



