#     - [х] в выбранных вариантах проставьте х или пропишите решение, если вариантов ответа не предусмотрено
#
# Задание 1. Что представляет собой переменная в Python?
#     - [ ] хранилище данных
#     - [ ] ничего из перечисленного
#     - [ ] и ссылка, и хранилище данных
#     - [x] ссылка на объект в памяти
#
# Задание 2. Что делает оператор присваивания (=)?
#     - [ ] создает переменную, если ее ранее не было
#     - [x] связывает переменную с данными
#     - [ ] обнуляет значение переменной
#     - [ ] заносит данные в переменную
#     - [ ] удаляет переменную с указанным именем
#
# Задание 3. Какая типизация реализована в Python? Отметьте все верные варианты.
#     - [ ] строгая типизация
#     - [x] динамическая типизация
#     - [ ] нестрогая типизация
#     - [ ] статическая типизация
#
# Задание 4. Что происходит при присваивании одной переменной другой (a = b)?
#     - [ ] создаются две переменные, если они до этого не существовали, с нулевыми значениями
#     - [ ] такая операция недопустима: можно присваивать только объекты, а не переменные
#     - [ ] копирование данных и переменная a будет содержать копию информации из переменной b
#     - [x] копирование ссылки и обе переменные ссылаются на один и тот же объект
#
# Задание 5. Как называется присваивание вида a = b = c = 0?
#     - [ ] цепным присваиванием
#     - [ ] каскадным присваиванием
#     - [ ] такая операция недопустима
#     - [x] множественным присваиванием
#     - [ ] унитарным присваиванием
#
# Задание 6. Как называется присваивание вида a, b = 1, 2?
#     - [x] каскадным присваиванием
#     - [ ] унитарным присваиванием
#     - [ ] цепным присваиванием
#     - [ ] такая операция недопустима
#     - [ ] множественным присваиванием
#
# Задание 7. Для чего используется функция type?
#     - [ ] для определения типа объекта, но не переменной
#     - [x] для определения типа переменной, но не объекта
#     - [ ] для определения типа переменной или объекта
#     - [ ] такой функции в языке Python нет
#
# Задание 8. Выберите только правильные имена переменных.
#     - [ ] \n
#     - [ ] 7_b
#     - [x] var_a
#     - [ ] S
#     - [ ] _b
#     - [ ] __arg_c__
#     - [ ] d25
#     - [ ] don't
#     - [ ] 25d
#     - [ ] TT1
#
# Задание 9. Различаются ли имена переменных arg, Arg, ARG?
#     - [x] да
#     - [ ] нет
#     - [ ] такие имена недопустимы
#     - [ ] иногда
#
# Задание 10. Выберите верные варианты присвоения данных переменной b (считается, что других переменных в программе нет).
#     - [x] b = "hello"
#     - [x] b = "True"
#     - [ ] "abc" = b
#     - [ ] 5 = b
#     - [ ] False = b
#     - [x] b = 5.8
#     - [ ] b = hello
#
# Задание 11. Что произойдет, если функции type присвоить число 7 (type = 7)?
#     - [ ] операция будет просто проигнорирована и программа продолжит выполняться дальше
#     - [ ] функция type возвратит тип числа 7
#     - [ ] число 7 станет синонимом функции type
#     - [x] произойдет ошибка, так как type - это встроенная функция языка Python
#     - [ ] переменная type будет ссылаться на число 7

# Задание 12. Придумайте и запишите напротив названия переменным, в которых будут храниться:
#   hight - высота
#   width - ширина
#   (price)dec 10.45- стоимость товара
#   age - возраст
#   error- сообщение об ошибке
#   1 - сообщение об успехе
#   all_students- количество студентов
#   name_user  - имя пользователя
#   mid_degrece - Средняя температура за день
#   all_sells_month - Общий объем продаж за месяц
#   show_videos - Количество просмотров видео
#   eladress- Электронный адрес пользователя
#   free_places- Количество доступных мест в аудитории
#   max_widh- Максимальная грузоподъемность лифта
#   finish_proces- Процент выполнения задачи
#     - Оценка пользователя после обслуживания
#     - Суммарное время ожидания в очереди
#     - Число страниц в документе
