# Задание 1. К какому типу данных относится числовой тип int?
#     - [ ] комплексному
#     - [ ] такой тип данных не существует
#     - [ ] вещественному
#     - [+] целочисленному
#
# Задание 2. К какому типу данных относится числовой тип float?
#     - [ ] целочисленному
#     - [ ] комплексному
#     - [ ] такой тип данных не существует
#     - [+] вещественному
#
# Задание 3. Какой тип данных отобразит команда print(type(-36))?
#     - [+] complex
#     - [ ] bool
#     - [ ] float
#     - [ ] str
#     - [ ] int
#
# Задание 4. Какой тип данных отобразит команда print(type(3.67))?
#     - [ ] str
#     - [ ] int
#     - [+] float
#     - [ ] complex
#     - [ ] bool
#
# Задание 5. Поставьте соответствия между арифметическими операторами и их названиями.
#     - [3] целочисленное деление
#     - [4 ] возведение в степень
#     - [3] остаток от деления
#     - [3] деление
#
# Задание 6. Какое значение мы увидим при выполнении в консоли команды 7.0 + 2.5?
#     - [+] 9.5
#     - [ ] 9,5
#
# Задание 7. Какое значение будет получено при вычислении 2 ** 4? 2*2*2*2
#
# Задание 8. Какое значение будет получено при вычислении 32 / 2 ** 4= 2

#
# Задание 9. Какое значение будет получено при вычислении 11 % 3= 2
#
# Задание 10. Какое значение будет получено при вычислении 11 % 33 = 11
#
# Задание 11. Какой будет результат при выполнении команды 21 // 4= 5
#
# Задание 12. Какой будет порядок выполнения операций 3 + 5 * 9 // 4 ** (2 - 1)
#(2 -1)
#4 **
#9//
#3+5*

#
# Задание 13. Какой тип данных мы увидим, выполнив строчку print(type(8/2))?
#     - [+] float
#     - [ ] int
#     - [ ] complex
#     - [ ] str
#
# Задание 14. Чему будет равно итоговое значение переменной i при выполнении программы:
#   i = 2
#   i += 3 =5
#   print(i)

#
# Задание 15. Чему будет равно итоговое значение переменной k при выполнении программы:
#   k = 8
#   k *= 2
#   print(k) =16
#
# Задание 16. Допишите текст программы для вычисления модуля введенного с клавиатуры числа в переменную d и вывода значения в консоль с помощью функции print.
#   Например, ввод:
#   -5
#   Вывод:
#   5

d = -5
print(d)

d = 5
print(d)
