#     - [х] в выбранных вариантах проставьте х или пропишите решение, если вариантов ответа не предусмотрено
#
# Задание 1. Что представляет собой переменная в Python?
#     - [] хранилище данных
#     - [ ] ничего из перечисленного
#     - [ ] и ссылка, и хранилище данных
#     - [х] ссылка на объект в памяти
#
# Задание 2. Что делает оператор присваивания (=)?
#     - [ ] создает переменную, если ее ранее не было
#     - [х] связывает переменную с данными
#     - [ ] обнуляет значение переменной
#     - [ ] заносит данные в переменную
#     - [ ] удаляет переменную с указанным именем
#
# Задание 3. Какая типизация реализована в Python? Отметьте все верные варианты.
#     - [х] строгая типизация
#     - [х] динамическая типизация
#     - [ ] нестрогая типизация
#     - [ ] статическая типизация
#
# Задание 4. Что происходит при присваивании одной переменной другой (a = b)?
#     - [ ] создаются две переменные, если они до этого не существовали, с нулевыми значениями
#     - [ ] такая операция недопустима: можно присваивать только объекты, а не переменные
#     - [ ] копирование данных и переменная a будет содержать копию информации из переменной b
#     - [х] копирование ссылки и обе переменные ссылаются на один и тот же объект
#
# Задание 5. Как называется присваивание вида a = b = c = 0?
#     - [х] цепным присваиванием
#     - [ ] каскадным присваиванием
#     - [ ] такая операция недопустима
#     - [ ] множественным присваиванием
#     - [ ] унитарным присваиванием
#
# Задание 6. Как называется присваивание вида a, b = 1, 2?
#     - [х] каскадным присваиванием
#     - [ ] унитарным присваиванием
#     - [ ] цепным присваиванием
#     - [ ] такая операция недопустима
#     - [ ] множественным присваиванием
#
# Задание 7. Для чего используется функция type?
#     - [ ] для определения типа объекта, но не переменной
#     - [х] для определения типа переменной, но не объекта
#     - [ ] для определения типа переменной или объекта
#     - [ ] такой функции в языке Python нет
#
# Задание 8. Выберите только правильные имена переменных.
#     - [ ] \n
#     - [ ] 7_b
#     - [х] var_a
#     - [ ] S
#     - [х] _b
#     - [х] __arg_c__
#     - [х] d25
#     - [ ] don't
#     - [ ] 25d
#     - [ ] TT1
#
# Задание 9. Различаются ли имена переменных arg, Arg, ARG?
#     - [х] да
#     - [ ] нет
#     - [ ] такие имена недопустимы
#     - [ ] иногда
#
# Задание 10. Выберите верные варианты присвоения данных переменной b (считается, что других переменных в программе нет).
#     - [х] b = "hello"
#     - [х] b = "True"
#     - [ ] "abc" = b
#     - [ ] 5 = b
#     - [ ] False = b
#     - [х] b = 5.8
#     - [ ] b = hello
#
# Задание 11. Что произойдет, если функции type присвоить число 7 (type = 7)?
#     - [ ] операция будет просто проигнорирована и программа продолжит выполняться дальше
#     - [ ] функция type возвратит тип числа 7
#     - [ ] число 7 станет синонимом функции type
#     - [x] произойдет ошибка, так как type - это встроенная функция языка Python
#     - [ ] переменная type будет ссылаться на число 7

# Задание 12. Придумайте и запишите напротив названия переменным, в которых будут храниться:
#    height - высота
#    width - ширина
#    price_product - стоимость товара
#    age - возраст
#    error_attention - сообщение об ошибке
#    success_message - сообщение об успехе
#    student_amount - количество студентов
#    user_name - имя пользователя
#    average_temp - Средняя температура за день
#    total_sales - Общий объем продаж за месяц
#    views_number - Количество просмотров видео
#    user_email - Электронный адрес пользователя
#    free_places - Количество доступных мест в аудитории
#    maks_weight - Максимальная грузоподъемность лифта
#    percent_task - Процент выполнения задачи
#    rating_service - Оценка пользователя после обслуживания
#    total_waiting - Суммарное время ожидания в очереди
#    page_number - Число страниц в документе

