# ДАННЫЕ И ПЕРЕМЕННЫЕ
# Продемонстрируйте работу переменных и разных типов данных. Объясните механизм работы кода.
# - Переменные с разным типом данных: строками, целыми и дробными числами
# - Вывод типа данных через print(type())
# - Обращение к несуществующим переменным или объявленным ниже
# - Переприсвание, каскадное присваивание, множественное присваивание
# - Наименования переменных








# ЧИСЛА И ОПЕРАЦИИ НАД НИМИ
# Продемонстрируйте работу с числами и арифметическими операциями.
# Объясните механизм работы кода.
# - Разные типы чисел: int, float
# - Выполнение арифметических операций +, -, *, /, //, %, **
# - Сокращенная запись +=, -=, *=, /+ и т.д.
# - Применение встроенных математических функций








# ФУНКЦИИ PRINT(), INPUT()
# Продемонстрируйте работу:
# - print()
# - input()
# - sep=
# - end=
# - строки и переменные в print(), input()
#
# Объясните механизм работы кода.
