# Темы: Операции над строками, Индексы и срезы строк
# Результат по каждому заданию необходимо выводить в консоль через print().

# 1. Объедините строки "Hello" и "London" без пробела. Ожидаемый результат: "HelloLondon"
str12="Hello"
str13="London"
result= str12+str13
print(result)
# 2. Выведите последний символ строки "Programming". Ожидаемый результат: "g"
str="Programming"
result= str[-1]
print(result)
# 3. Дублируйте строку "Hi" три раза. Ожидаемый результат: "HiHiHi"
str45="Hi"
result= str45*3
print(result)

# 4. Определите длину строки "Artificial Intelligence".
str1= "Artificial Intelligence"
result = len(str1)
print(result)
# 5. Объедините строки "Good" и "Morning" с запятой между ними. Ожидаемый результат: "Good,Morning"
str12="Good"
str13="Morning"
result= str12+","+str13
print(result)
# 6. Создайте срез строки "Natural Language Processing" со значением "nguag".
str2="Natural Language Processing"
result=str2[10:15]
print(result)
# 7. Объедините строки "Data" и "Science" с дефисом между ними. Ожидаемый результат: "Data-Science"
str12="Data"
str13="Science"
result= str12+"-"+str13
print(result)
# 8. Объедините строки "AI" и "ML" с двоеточием между ними. Ожидаемый результат: "AI:ML"
str12="AI"
str13="ML"
result= str12+":"+str13
print(result)
# 9. Дублируйте строку "Test" шесть раз. Ожидаемый результат: "TestTestTestTestTestTest"
str45="Test"
result= str45*6
print(result)
# 10. Выведите первый символ строки "Python". Ожидаемый результат: "P"
str3="Python"
result= str[0]
print(result)
# 11. Создайте срез строки "Hello, Anna!" от 0 до 5. Ожидаемый результат: "Hello"
str4="Hello, Anna!"
result=str4[0:5]
print(result)
# 12. Определите длину строки "Natural Language Processing".
str5= "Natural Language Processing"
result = len(str5)
print(result)

# 13. Выведите второй символ строки "Лето". Ожидаемый результат: "е"
str6="Лето"
result = str6[1]
print(result)
# 14. Выведите предпоследний символ строки "Machine Learning". Ожидаемый результат: "n"
str7="Machine Learning"
result = str7[-2]
print(result)
# 15. Дублируйте строку "Yes" четыре раза. Ожидаемый результат: "YesYesYesYes"
str45="Yes"
result= str45*4
print(result)
# 16. Создайте срез строки "Deep Learning" со значением "ep Le".
str8 = "Deep Learning"
result= str8[2:7]
print(result)
# 17. Выведите третий символ строки "Computer Vision". Ожидаемый результат: "m"
str9="Computer Vision"
result = str9[2]
print(result)
# 18. Определите длину строки "Deep Learning". Ожидаемый результат: 13
str10="Deep Learning"
result = len(str10)
print(result)
# 19. Объедините строки "Python" и "Rocks" с пробелом между ними. Ожидаемый результат: "Python Rocks"
str12="Python"
str13="Rocks"
result= str12+" "+str13
print(result)
# 20. Создайте срез строки "Data Science" со значением "cien".
str11="Data Science"
result = str11[6:10]
print(result)


