# Темы: Операции над строками, Индексы и срезы строк
# Результат по каждому заданию необходимо выводить в консоль через print().

# 1. Объедините строки "Hello" и "London" без пробела. Ожидаемый результат: "HelloLondon"
a = "Hello" +" "+ "London"
print(a)



# 2. Выведите последний символ строки "Programming". Ожидаемый результат: "g"
b = "Programming"
print(b[-1])

# 3. Дублируйте строку "Hi" три раза. Ожидаемый результат: "HiHiHi"
c = "Hi"
print(c *3)


# 4. Определите длину строки "Artificial Intelligence".
d = "Artificial Intelligence"
print(len(d))


# 5. Объедините строки "Good" и "Morning" с запятой между ними. Ожидаемый результат: "Good,Morning"
e = "Good" + "," + "Morning"
print(e)
# 6. Создайте срез строки "Natural Language Processing" со значением "nguag".
a_1 = "Natural Language Processing"
a_2 = a_1[10]
a_3 = a_1[11]
a_4 = a_1[12]



# 7. Объедините строки "Data" и "Science" с дефисом между ними. Ожидаемый результат: "Data-Science"

b_2 = "Data"+ "-" +"Science"
print(b_2)
# 8. Объедините строки "AI" и "ML" с двоеточием между ними. Ожидаемый результат: "AI:ML"

b_3 = "AI" + ":"+"ML"
print(b_3)
# 9. Дублируйте строку "Test" шесть раз. Ожидаемый результат: "TestTestTestTestTestTest"
b_4 = "Test"
print(b_4 *6)


# 10. Выведите первый символ строки "Python". Ожидаемый результат: "P"
b_5 = "Python"
print(b_5[0])



# 11. Создайте срез строки "Hello, Anna!" от 0 до 5. Ожидаемый результат: "Hello"
b_6 = "Hello, Anna!"
print(b_6)

# 12. Определите длину строки "Natural Language Processing".
b_7 = "Natural Language Processing"
print(len(b_7))


# 13. Выведите второй символ строки "Лето". Ожидаемый результат: "е"
str_1 = "Лето"
print(str_1[1])


# 14. Выведите предпоследний символ строки "Machine Learning". Ожидаемый результат: "n"
str_2 = "Machine Learning"
print(str_2[-2])


# 15. Дублируйте строку "Yes" четыре раза. Ожидаемый результат: "YesYesYesYes"
str_3 = "Yes"
print(str_3*4)


# 16. Создайте срез строки "Deep Learning" со значением "ep Le".
str_4 = "Deep Learning"


# 17. Выведите третий символ строки "Computer Vision". Ожидаемый результат: "m"
str_5 = "Computer Vision"
print(str_5[2])


# 18. Определите длину строки "Deep Learning". Ожидаемый результат: 13
str_6 = "Deep Learning"
print(len(str_6))


# 19. Объедините строки "Python" и "Rocks" с пробелом между ними. Ожидаемый результат: "Python Rocks"
str_7 = "Python" +" "+ "Rocks"
print(str_7)

# 20. Создайте срез строки "Data Science" со значением "cien".
str_8 = "Data Science"
print(str_8[6:10])


