# Тема: Вложенные циклы

# Упражнение 1: Таблица умножения

# - Создайте программу, которая выводит таблицу умножения размером 10x10.
# - Используйте вложенные циклы `for` для создания строк и столбцов таблицы.
# - Форматируйте вывод так, чтобы таблица выглядела аккуратно.

# Ожидаемый вывод программы:
# for el in range(1,11):
#     for el2 in range(1,11):
#         print(f"{el * el2:4} ", end=" ")
#     print()
numbers=range(1,11)
print("    ", end="")
for i in numbers:
    print(f"{i:3}", end=" ")
print()
print("-"* 44, end=" ")
for row in numbers:
    print(f"\n{row:2} |", end=" ")
    for cell in numbers:
        print(f"{row * cell:3}", end=" " )

#        1   2   3   4   5   6   7   8   9  10
# ---------------------------------------------
#  1 |   1   2   3   4   5   6   7   8   9  10
#  2 |   2   4   6   8  10  12  14  16  18  20
#  3 |   3   6   9  12  15  18  21  24  27  30
#  4 |   4   8  12  16  20  24  28  32  36  40
#  5 |   5  10  15  20  25  30  35  40  45  50
#  6 |   6  12  18  24  30  36  42  48  54  60
#  7 |   7  14  21  28  35  42  49  56  63  70
#  8 |   8  16  24  32  40  48  56  64  72  80
#  9 |   9  18  27  36  45  54  63  72  81  90
# 10 |  10  20  30  40  50  60  70  80  90 100

numbers = range(1,11)

# Шапка
print('     ', end='')
for i in numbers:
    print(f'{i:3}', end=' ')
print()
print('-' * 44, end='')

# Колонки
for row in numbers:
    print(f'\n{row:2} |', end=' ')
    for cell in numbers:
        print(f'{row*cell:3}', end=' ')

