# Тема: Цикл while. Операторы break, continue, else.
# Продемонстрируйте создание и использование цикла while.

# i = 0
# while i < 10:
#     print(f"Итерация {i}")
#     i += 1
#
# # Показать использование оператора break для выхода из цикла.
#     if i == 7:
#         break
# # Показать использование оператора continue для пропуска итерации.
#     if i == 2:
#         print("Пропуск итерации 2")
#         i += 1
#         continue
# print(f"Завершение итерации {i}")


# i = 0
# while i < 5:
#     print(f"Итерация {i}")
#     i += 1
#     if i == 3:
#         break  # Пропускаем итерацию, когда i равно 3
# else:
#     print("Цикл завершен без прерывания")

# # Продемонстрируйте создание и использование цикла for.
# fructs = ["яблоко", "банан", "вишня", "груша"]
# for idx, fruit in enumerate(fructs):
#     print(f"Фрукт: {fruit}, index: {idx}")

# Показать использование оператора else в цикле for.
# for i in range(5):
#     print(f"Итерация {i}")
#     if i == 3:
#         print("Прерывание цикла на 3-й итерации")
#         break
# else:
#     print("Цикл for завершен без прерывания")

# Показать использование функций range, enumerate.
l = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
ll = list(range(1, 11))